"""
Завдання на послідовність. 
 ! Послідовність чисел повинна закінчуватись 0. 
 ! Останнє число не повинно бути числом, яким закінчується послідовність. 
 ( тобто, у послідовності 1 2 3 4 0 останнє число, яке буде враховуватись для завдань - 4 ) 
 ! Ввід та вивід у консолі 
"""




numbers = []
while True:
    x = int(input("Введіть число (введіть 0 для завершення): "))
    if x == 0:
        break
    numbers.append(x)

last_number = numbers[-1]
print("Останнє число в послідовності: ", last_number)