""""

! Завдання відсортовано за складністю
1. Порахувати сумму чисел послідовності 
2. Порахувати добуток чисел послідовності 
3. Порахувати кількість чисел у послідовності 
4. Мінімальне та максимальне числа послідовності
5. Індекс (розташування, номер по порядку введення) мінімального та максимального числа послідовності 
6. Кількість максимальних та мінімальних чисел у послідовності

"""

numbers = []
while True:
    x = int(input("Введіть число (введіть 0 для завершення): "))
    if x == 0:
        break
    #присваивает значения инпута в лист numbers
    numbers.append(x)


for number in numbers:
    summa = number + number

print(summa) 
